w10d1/library/app/controllers/books_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def index
    @author = Author.find( params[:author_id] )